app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    sort = params[:sort_by] || "null"
	@all_ratings = Movie.all_ratings
	@selected_rating = params[:ratings] || {}
	case sort
	when "title"
		@movies = Movie.find(:all,:order=>"title")
		return @movies
	when "date"
		@movies = Movie.find(:all,:order=>"release_date")
		return @movies
	end
	if @selected_rating == {}
    	@movies = Movie.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # Look up movie by unique ID